## production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.route53_resolver_query_log[0]`                                |
|        | `aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0]`                     |
|        | `aws_cloudwatch_log_metric_filter.route53_servfail_notification[0]`                     |
|        | `aws_cloudwatch_log_resource_policy.route53_resolver_query_logging_policy[0]`           |
|        | `aws_cloudwatch_metric_alarm.route53-dns-failures-critical[0]`                          |
|        | `aws_cloudwatch_metric_alarm.route53-dns-failures-warning[0]`                           |
|        | `aws_route53_resolver_query_log_config.main[0]`                                         |
| delete | `aws_route53_resolver_query_log_config.dns_query_log_config[0]`                         |
|        | `aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.route53_resolver_query_log[0] will be created
  + resource "aws_cloudwatch_log_group" "route53_resolver_query_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (sensitive value)
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_cloudwatch_log_metric_filter.route53_nxdomain_notification[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "route53_nxdomain_notification" {
      + id             = (known after apply)
      + log_group_name = (sensitive value)
      + name           = "Route53NXDOMAINNotificationDomain"
      + pattern        = "?notification.canada.ca NXDOMAIN"

      + metric_transformation {
          + name      = "Route53PublicDNSResolutionFailureCount"
          + namespace = "Route53/PublicResolver"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.route53_servfail_notification[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "route53_servfail_notification" {
      + id             = (known after apply)
      + log_group_name = (sensitive value)
      + name           = "Route53SERVFAILNotificationDomain"
      + pattern        = "?notification.canada.ca SERVFAIL"

      + metric_transformation {
          + name      = "Route53PublicDNSResolutionFailureCount"
          + namespace = "Route53/PublicResolver"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_resource_policy.route53_resolver_query_logging_policy[0] will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_resolver_query_logging_policy" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53-resolver-query-logging-policy"
    }

  # aws_cloudwatch_metric_alarm.route53-dns-failures-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "route53-dns-failures-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ]
      + alarm_description                     = "Alarm for Route53 DNS resolution failures exceeding threshold"
      + alarm_name                            = "route53-dns-resolution-failures-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ]
      + metric_name                           = "Route53PublicDNSResolutionFailureCount"
      + namespace                             = "Route53/PublicResolver"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:296255494825:alert-ok-us-east-1",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.route53-dns-failures-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "route53-dns-failures-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ]
      + alarm_description                     = "Alarm for Route53 DNS resolution failures exceeding threshold"
      + alarm_name                            = "route53-dns-resolution-failures-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:us-east-1:296255494825:alert-warning-us-east-1",
        ]
      + metric_name                           = "Route53PublicDNSResolutionFailureCount"
      + namespace                             = "Route53/PublicResolver"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:296255494825:alert-ok-us-east-1",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_route53_resolver_query_log_config.dns_query_log_config[0] will be destroyed
  # (because aws_route53_resolver_query_log_config.dns_query_log_config is not in configuration)
  - resource "aws_route53_resolver_query_log_config" "dns_query_log_config" {
      - arn             = "arn:aws:route53resolver:ca-central-1:296255494825:resolver-query-log-config/rqlc-8f0f60bdbe194652" -> null
      - destination_arn = "arn:aws:logs:ca-central-1:296255494825:log-group:route53/ca-central-1/296255494825/DNS/logs" -> null
      - id              = "rqlc-8f0f60bdbe194652" -> null
      - name            = (sensitive value) -> null
      - owner_id        = "296255494825" -> null
      - share_status    = "NOT_SHARED" -> null
      - tags            = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all        = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
    }

  # aws_route53_resolver_query_log_config.main[0] will be created
  + resource "aws_route53_resolver_query_log_config" "main" {
      + arn             = (known after apply)
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + name            = "route53-query-logging"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags            = {
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
          + "Service"     = "dns-monitoring"
        }
      + tags_all        = {
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
          + "Service"     = "dns-monitoring"
        }
    }

  # aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0] will be destroyed
  # (because aws_route53_resolver_query_log_config_association.dns_query_log_config_association is not in configuration)
  - resource "aws_route53_resolver_query_log_config_association" "dns_query_log_config_association" {
      - id                           = "rqlca-815b4ef4577a4ee2" -> null
      - resolver_query_log_config_id = "rqlc-8f0f60bdbe194652" -> null
      - resource_id                  = "vpc-0e02e0295db594518" -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 71 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
